src_ext/DataProcessors/УЗ_МоиУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_МоиУроки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_РасчетыПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_РасчетыПоЗарплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеИзменять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_МоиУроки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//«Мои уроки» — рабочее место педагога: свои уроки за период, явка, тема и домашнее задание.
//Какие уроки «свои», решают ДВА рубежа: роль «Учёт занятий: педагог» (ограничение доступа на уровне записей:
//урок читается и пишется, только если педагог урока связан с текущим пользователем — реквизит «Пользователь
//программы» карточки педагога и параметр сеанса хозяина ТекущийПользователь) и проверка здесь (урок другого
//педагога — отказ с причиной, даже у пользователя с широкими правами). Деньги учеников («К оплате», цены, абонементы)
//и состав урока отметки не меняют.

//Карточка педагога текущего пользователя (физ. лицо «Это педагог» с «Пользователь программы» = текущий
//пользователь) или пустая ссылка.
Функция ПедагогТекущегоПользователя() Экспорт

	Пользователь = УЗ_Среда.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Справочники.УЗ_ФизЛица.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФизЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Пользователь = &Пользователь
	|	И ФизЛица.ЭтоПедагог
	|	И НЕ ФизЛица.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛица.Наименование");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.УЗ_ФизЛица.ПустаяСсылка());

КонецФункции

//Уроки педагога за период (РАЗРЕШЕННЫЕ: под ролью педагога — только свои). Возврат — Массив Структур
//(Урок, Начало, Занятие, Помещение, Учеников, Проведен, Состояние).
Функция УрокиПедагога(Педагог, НачалоПериода, КонецПериода) Экспорт

	Уроки = Новый Массив;
	Если Не ЗначениеЗаполнено(Педагог) Тогда
		Возврат Уроки;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Урок.Ссылка КАК Урок,
	|	Урок.Дата КАК Начало,
	|	Урок.Проведен КАК Проведен,
	|	Урок.ПредметОбучения.Наименование КАК Предмет,
	|	Урок.ГруппаОбучения.Наименование КАК Группа,
	|	Урок.Помещение.Наименование КАК Помещение,
	|	ЕСТЬNULL(Строки.Учеников, 0) КАК Учеников
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УрокУченики.Ссылка КАК Ссылка,
	|			КОЛИЧЕСТВО(УрокУченики.НомерСтроки) КАК Учеников
	|		ИЗ
	|			Документ.УЗ_Урок.Ученики КАК УрокУченики
	|		ГДЕ
	|			УрокУченики.Ссылка.Педагог = &Педагог
	|			И УрокУченики.Ссылка.Дата МЕЖДУ &Начало И &Конец
	|		СГРУППИРОВАТЬ ПО
	|			УрокУченики.Ссылка) КАК Строки
	|		ПО Урок.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Урок.Педагог = &Педагог
	|	И Урок.Дата МЕЖДУ &Начало И &Конец
	|	И НЕ Урок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Урок.Дата");
	Запрос.УстановитьПараметр("Педагог", Педагог);
	Запрос.УстановитьПараметр("Начало", НачалоПериода);
	Запрос.УстановитьПараметр("Конец", ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, '39991231235959'));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Занятие = ?(ЗначениеЗаполнено(Выборка.Группа), Выборка.Группа, Выборка.Предмет);
		Уроки.Добавить(Новый Структура("Урок, Начало, Занятие, Помещение, Учеников, Проведен, Состояние",
			Выборка.Урок, Выборка.Начало, Занятие, Выборка.Помещение, Выборка.Учеников, Выборка.Проведен,
			?(Выборка.Проведен, НСтр("ru = 'проведён'"), НСтр("ru = 'план'"))));
	КонецЦикла;
	Возврат Уроки;

КонецФункции

//Данные урока для отметок: Структура(Урок, Ученики — Массив Структур(НомерСтроки, Ученик, Явка), ТемаУрока,
//ДомашнееЗадание, Проведен, Состояние — строка над таблицей учеников). Урок другого педагога — ВызватьИсключение.
Функция ДанныеУрока(Урок) Экспорт

	ПроверитьСвойУрок(Урок);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Урок.ТемаУрока КАК ТемаУрока,
	|	Урок.ДомашнееЗадание КАК ДомашнееЗадание,
	|	Урок.Проведен КАК Проведен,
	|	Урок.Дата КАК Дата
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Ссылка = &Урок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УрокУченики.НомерСтроки КАК НомерСтроки,
	|	УрокУченики.Ученик КАК Ученик,
	|	УрокУченики.Явка КАК Явка
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	УрокУченики.Ссылка = &Урок
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	Запрос.УстановитьПараметр("Урок", Урок);
	Пакет = Запрос.ВыполнитьПакет();
	Шапка = Пакет[0].Выбрать();
	Шапка.Следующий();
	Ученики = Новый Массив;
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Ученики.Добавить(Новый Структура("НомерСтроки, Ученик, Явка", Выборка.НомерСтроки, Выборка.Ученик, Выборка.Явка));
	КонецЦикла;
	Если Шапка.Проведен Тогда
		Состояние = НСтр("ru = 'Урок проведён: отметки перепроведут урок, оплату учеников они не меняют'");
	ИначеЕсли Шапка.Дата > ТекущаяДатаСеанса() Тогда
		Состояние = НСтр("ru = 'Урок ещё не начался — можно заранее записать тему и задание'");
	Иначе
		Состояние = НСтр("ru = 'Урок не проведён: отметки запишутся, провести урок (оплату) — администратору'");
	КонецЕсли;
	Возврат Новый Структура("Урок, Ученики, ТемаУрока, ДомашнееЗадание, Проведен, Состояние", Урок, Ученики,
		Шапка.ТемаУрока, Шапка.ДомашнееЗадание, Шапка.Проведен, Состояние);

КонецФункции

//Записать отметки педагога. Отметки — Массив Структур(НомерСтроки, Явка). Меняются только явка строк, тема и
//домашнее задание; проведённый урок перепроводится (явки в регистре), непроведённый — записывается (план/факт и
//оплату решает администратор). Возврат — Структура(Успех, Текст).
Функция ЗаписатьОтметки(Урок, Отметки, ТемаУрока, ДомашнееЗадание) Экспорт

	Попытка
		ПроверитьСвойУрок(Урок);
		Объект = Урок.ПолучитьОбъект();
	Исключение
		Возврат Новый Структура("Успех, Текст", Ложь, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Если Объект = Неопределено Тогда
		Возврат Новый Структура("Успех, Текст", Ложь, НСтр("ru = 'Урок не найден'"));
	КонецЕсли;
	Объект.ТемаУрока = ТемаУрока;
	Объект.ДомашнееЗадание = ДомашнееЗадание;
	Для Каждого Отметка Из Отметки Цикл
		СтрокаУченика = Объект.Ученики.Найти(Отметка.НомерСтроки, "НомерСтроки");
		Если СтрокаУченика <> Неопределено Тогда
			СтрокаУченика.Явка = Отметка.Явка;
		КонецЕсли;
	КонецЦикла;
	Итог = УЗ_Общий.ЗаписатьУрок(Объект, Ложь);
	Если Не Итог.Успех Тогда
		Возврат Новый Структура("Успех, Текст", Ложь, СтрШаблон(НСтр("ru = 'Отметки урока %1 не записаны: %2'"), Урок, Итог.Текст));
	КонецЕсли;
	Возврат Новый Структура("Успех, Текст", Истина, СтрШаблон(НСтр("ru = 'Отметки урока %1 записаны'"), Урок));

КонецФункции

//Своя зарплата педагога за период: начисления (уроки, разовые начисления) и выплаты по документам и остаток к
//оплате на конец периода. РАЗРЕШЕННЫЕ: под ролью педагога регистр расчётов с педагогами читается только по нему.
//(Отчёт «Расчёты по зарплате» на СКД педагогу не дан: СКД убирает из него поля, у которых нет права «Просмотр» —
//педагог и документ, а «Просмотр» уроков и физ. лиц открыл бы педагогу их списки.)
//Возврат — Структура(Строки — Массив Структур(Документ — строкой, Дата, Начислено, Выплачено), Начислено,
//Выплачено, Остаток).
Функция ЗарплатаПедагога(Педагог, НачалоПериода, КонецПериода) Экспорт

	Итог = Новый Структура("Строки, Начислено, Выплачено, Остаток", Новый Массив, 0, 0, 0);
	Если Не ЗначениеЗаполнено(Педагог) Тогда
		Возврат Итог;
	КонецЕсли;
	Конец = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, '39991231235959');
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Регистратор КАК Документ,
	|	МИНИМУМ(Расчеты.Период) КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Расчеты.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено,
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Расчеты.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Выплачено
	|ИЗ
	|	РегистрНакопления.УЗ_РасчетыПоЗарплате КАК Расчеты
	|ГДЕ
	|	Расчеты.Педагог = &Педагог
	|	И Расчеты.Активность
	|	И Расчеты.Период МЕЖДУ &Начало И &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.УЗ_РасчетыПоЗарплате.Остатки(&Граница, Педагог = &Педагог) КАК Остатки");
	Запрос.УстановитьПараметр("Педагог", Педагог);
	Запрос.УстановитьПараметр("Начало", НачалоПериода);
	Запрос.УстановитьПараметр("Конец", Конец);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Конец, ВидГраницы.Включая));
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Итог.Строки.Добавить(Новый Структура("Документ, Дата, Начислено, Выплачено", Строка(Выборка.Документ),
			Выборка.Дата, Выборка.Начислено, Выборка.Выплачено));
		Итог.Начислено = Итог.Начислено + Выборка.Начислено;
		Итог.Выплачено = Итог.Выплачено + Выборка.Выплачено;
	КонецЦикла;
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Итог.Остаток = Выборка.Остаток;
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Урок принадлежит педагогу текущего пользователя — иначе исключение с причиной (второй рубеж после роли).
Процедура ПроверитьСвойУрок(Урок)

	Педагог = ПедагогТекущегоПользователя();
	Если Не ЗначениеЗаполнено(Педагог) Тогда
		ВызватьИсключение НСтр("ru = 'Вы не связаны с карточкой педагога: руководитель указывает «Пользователь программы» в карточке педагога'");
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Урок.Педагог КАК Педагог
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Ссылка = &Урок");
	Запрос.УстановитьПараметр("Урок", Урок);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Выборка.Педагог <> Педагог Тогда
		ВызватьИсключение НСтр("ru = 'Это урок другого педагога — отмечать можно только свои уроки'");
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
